IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_lcm_regs.xml
<module id="LCM_REGS" HW_revision="" description="LCM Registers">
	<register id="REVISION" width="32" page="1" offset="0x0" internal="0" description="IP Revision tie-off value">
		<bitfield id="MINOR" description="Minor Revision Number" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="Custom Module Number" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MAJOR" description="Major Revision Number" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="FUNC" description="Functional Release Number" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="Defines Scheme for Module" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="LCM_CONTROL" width="32" page="1" offset="0x4" internal="0" description="LCM Control configuration">
		<bitfield id="CMPEN" description="Enable/disable configuration for lockstep compare." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STEN" description="Self-test enable" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CMP1_ERR_FORCE" description="Force error on comparator-1 lockstep compare error output" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CMP2_ERR_FORCE" description="Force error on comparator-2 lockstep compare error output" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="LCM_STATUS" width="32" page="1" offset="0x10" internal="0" description="LCM status register">
		<bitfield id="LSEN" description="Lockstep configuration status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CMP_FAIL" description="Pass/fail status of lockstep compare" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="DBGCON" description="debugger connected status information" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="STPASS" description="self-test pass/fail status" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="STDONE" description="self-test completion status" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="STACTIVE" description="self-test active status indication" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CMP1_ERR_FORCE_PASS" description="fail status of comparator1 func error forcing" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CMP1_ERR_FORCE_DONE" description="completion status of comparator1 func error forcing" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CMP2_ERR_FORCE_PASS" description="fail status of comparator2 func error forcing" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CMP2_ERR_FORCE_DONE" description="completion status of comparator2 func error forcing" begin="22" end="22" width="1" rwaccess="R"/>
	</register>
	<register id="LCM_STATUS_CLEAR" width="32" page="1" offset="0x14" internal="0" description="LCM Status clear register">
		<bitfield id="CMP_FAIL" description="Clear lockstep compare fail status" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="STPASS" description="clear Self-test_fail_status" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="STDONE" description="clear Self-test_done_status" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="reserved" description="Reserved" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CMP1_ERR_FORCE_PASS" description="clear cmp1_func_error_force_fail_status" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CMP1_ERR_FORCE_DONE" description="clear cmp1_func_error_force_done_status" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CMP2_ERR_FORCE_PASS" description="clear cmp2_func_error_force_fail_status" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CMP2_ERR_FORCE_DONE" description="clear cmp2_func_error_force_done_status" begin="22" end="22" width="1" rwaccess="RW"/>
	</register>
	<register id="PARITY_TEST" width="32" page="1" offset="0x34" internal="0" description="Enabling the parity test feature">
		<bitfield id="TESTEN" description="Parity test enable configuration" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="LCM_LOCK" width="32" page="1" offset="0x38" internal="0" description="LCM lock configuration">
		<bitfield id="LCM_CONTROL" description="Register lock configuration" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LCM_STATUS_CLEAR" description="Register lock configuration" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PARITY_TEST" description="Register lock configuration" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
	<register id="LCM_COMMIT" width="32" page="1" offset="0x3c" internal="0" description="LCM commit configuration">
		<bitfield id="LCM_CONTROL" description="Register commit configuration" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LCM_STATUS_CLEAR" description="Register commit configuration" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PARITY_TEST" description="Register commit configuration" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
</module>
